interop-mock/src/main/resources/whitemesa/soap12/test-rpc/echoBase64-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <ns1:echoBase64 soapenv:encodingStyle="http://www.w3.org/2003/05/soap-encoding" xmlns:ns1="http://example.org/ts-tests">
         <inputBase64 xsi:type="xsd:base64Binary">DAoPDg==</inputBase64>
      </ns1:echoBase64>
   </soapenv:Body>
</soapenv:Envelope>